tap "hashicorp/tap"
tap "homebrew/bundle"
tap "koekeishiya/formulae"

brew "eza"
brew "fzf"
brew "cmake"
brew "pyenv"
brew "neofetch"
brew "starship"
brew "pkg-config"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

# cask "wezterm"
# cask "obsidian"
# cask "visual-studio-code"

vscode "alefragnani.project-manager"
vscode "beardedbear.beardedicons"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "uloco.theme-bluloco-dark"
